{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "MMDiTTransformer2DModel",
    "parent_library": "flow_grpo.mmdit.ummdit_ds1_small_singlenorm_v10"
  },
  "base_model_name_or_path": null,
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": "gaussian",
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 64,
  "lora_bias": false,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 32,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "attn.add_q_proj",
    "attn.to_add_out",
    "attn.to_v",
    "attn.add_k_proj",
    "attn.add_v_proj",
    "attn.to_k",
    "attn.to_q",
    "attn.to_out.0"
  ],
  "task_type": null,
  "trainable_token_indices": null,
  "use_dora": false,
  "use_rslora": false
}